import { useBackend, useLocalState } from '../backend';
import { Button, Flex, Section, Divider, Tabs, Box } from '../components';
import { Window } from '../layouts';

export const VampireSpecMenu = (props, context) => {
  const { act } = useBackend(context);
  const [activeTab, setActiveTab] = useLocalState(
    context,
    'activeTab',
    'hemomancer'
  );

  const renderMenu = () => {
    switch (activeTab) {
      case 'hemomancer':
        return <HemoMenu act={act} />;
      case 'umbrae':
        return <UmbrMenu act={act} />;
      case 'gargantua':
        return <GarMenu act={act} />;
      case 'dantalion':
        return <DantMenu act={act} />;
      case 'bestia':
        return <BestMenu act={act} />;
      default:
        return null;
    }
  };

  return (
    <Window width={650} height={890} resizable theme="ntos_spooky">
      <Window.Content scrollable>
        <Box>
          <Button
            content="Гемомансер"
            onClick={() => setActiveTab('hemomancer')}
            selected={activeTab === 'hemomancer'}
          />
          <Button
            content="Умбра"
            onClick={() => setActiveTab('umbrae')}
            selected={activeTab === 'umbrae'}
          />
          <Button
            content="Гаргантюа"
            onClick={() => setActiveTab('gargantua')}
            selected={activeTab === 'gargantua'}
          />
          <Button
            content="Данталион"
            onClick={() => setActiveTab('dantalion')}
            selected={activeTab === 'dantalion'}
          />
          <Button
            content="Бестия"
            onClick={() => setActiveTab('bestia')}
            selected={activeTab === 'bestia'}
          />
        </Box>
        <Divider />
        {renderMenu()}
      </Window.Content>
    </Window>
  );
};

export const HemoMenu = (props, context) => {
  const { act, data } = useBackend(context);
  const { hemomancer } = data;
  return (
    <Section title="Гемомансер">
      <Box textAlign="center">
        <img
          height="256px"
          width="256px"
          src={`data:image/jpeg;base64,${hemomancer}`}
          style={{
            '-ms-interpolation-mode': 'nearest-neighbor',
          }}
        />
      </Box>
      <h3>Специализируется на магии крови и управлении ею.</h3>
      <p>
        <b>Когти</b>: Открывается от{' '}
        <i>
          150 <font color="red">ед. крови</font>
        </i>
        , позволяет призвать пару смертоносных когтей, позволяющих быстро
        атаковать цель, поглощая ее кровь и регенерируя свое здоровье.
      </p>
      <p>
        <b>Кровавый барьер</b>: Открывается от{' '}
        <i>
          250 <font color="red">ед. крови</font>
        </i>
        , позволяет вам выбрать две позиции для создания между ними стены.
      </p>
      <p>
        <b>Кровавые щупальца</b>: Открывается от{' '}
        <i>
          250 <font color="red">ед. крови</font>
        </i>
        , после небольшой задержки позволяет вам замедлить всех внутри выбранной
        области 3x3.
      </p>
      <p>
        <b>Погружение в кровь</b>: Открывается от{' '}
        <i>
          400 <font color="red">ед. крови</font>
        </i>
        , позволяет непродолжительное время передвигаться с большой скоростью,
        игнорируя все препятствия, кроме стен и космоса, а также оставляя за
        собой кровавый след.
      </p>
      <p>
        <b>Чутьё хищника</b>: Открывается от{' '}
        <i>
          600 <font color="red">ед. крови</font>
        </i>
        , позволяет вам почувствовать кого-угодно в пределах вашего сектора.
      </p>
      <p>
        <b>Извержение крови</b>: Открывается от{' '}
        <i>
          800 <font color="red">ед. крови</font>
        </i>
        , позволяет вам манипулировать окружающими вас лужами крови в радиусе
        четырех метров, превращая их в шипы, протыкающие любого наступившего на
        них.
      </p>
      <p>
        <b>Полная сила</b>
        <Divider />
        <b>Кровавый обряд</b>: Будучи включенным, позволяет вам поглощать кровь
        окружающих вас существ, благодаря чему вы будете медленно лечиться и
        восстанавливаться от каких-либо оглушающих эффектов.
      </p>
      <Button content="Гемомансер" onClick={() => act('hemomancer')} />
    </Section>
  );
};

export const UmbrMenu = (props, context) => {
  const { act, data } = useBackend(context);
  const { umbrae } = data;
  return (
    <Section title="Умбра">
      <Box textAlign="center">
        <img
          height="256px"
          width="256px"
          src={`data:image/jpeg;base64,${umbrae}`}
          style={{
            '-ms-interpolation-mode': 'nearest-neighbor',
          }}
        />
      </Box>
      <h3>Специализируется на темноте, засадах и скрытном перемещении.</h3>
      <p>
        <b>Покров тьмы</b>: Открывается от{' '}
        <i>
          150 <font color="red">ед. крови</font>
        </i>
        , будучи включенным, позволяет вам быть почти невидимым и быстро
        передвигаться в темных участках станции. Также, будучи активным,
        увеличивает любой урон от ожогов по вам.
      </p>
      <p>
        <b>Теневой якорь</b>: Открывается от{' '}
        <i>
          250 <font color="red">ед. крови</font>
        </i>
        , активация создает на месте применения маяк после небольшой задержки.
        Повторное использование телепортирует вас обратно к маяку. Если спустя
        две минуты после первого использования способность не была активирована
        снова, то вы будете автоматически возвращены к маяку. Маяк не способен
        телепортировать вас между секторами.
      </p>
      <p>
        <b>Теневая ловушка</b>: Открывается от{' '}
        <i>
          250 <font color="red">ед. крови</font>
        </i>
        , позволяет вам создавать ловушки, травмирующие и ослепляющие любого
        наступившего в них. Ловушку тяжело заметить, но она исчезает под
        воздействием источников яркого света.
      </p>
      <p>
        <b>Шаг в тень</b>: Открывается от{' '}
        <i>
          400 <font color="red">ед. крови</font>
        </i>
        , позволяет вам телепортироваться в любое место в пределах видимости.
      </p>
      <p>
        <b>Погасить</b>: Открывается от{' '}
        <i>
          600 <font color="red">ед. крови</font>
        </i>
        , позволяет вам выводить из строя любые электрические источники света, а
        также глоушрумы.
      </p>
      <b>Бой с тенью</b>: Открывается от{' '}
      <i>
        800 <font color="red">ед. крови</font>
      </i>
      , создает теневых клонов, которые будут атаковать цель, пока вы находитесь
      рядом.
      <p>
        <b>Полная сила</b>
        <Divider />
        <b>Вечная тьма</b>: после включения вы расстворяетесь в нечестивой
        темноте, в которой будет виден лишь сильнейший источник света. Холод,
        окружающей вас тьмы будет замораживать всех живых существ поблизости.
      </p>
      <p>Вы также получаете X-ray зрение</p>
      <Button content="Умбра" onClick={() => act('umbrae')} />
    </Section>
  );
};

export const GarMenu = (props, context) => {
  const { act, data } = useBackend(context);
  const { gargantua } = data;
  return (
    <Section title="Гаргантюа">
      <Box textAlign="center">
        <img
          height="256px"
          width="256px"
          src={`data:image/jpeg;base64,${gargantua}`}
          style={{
            '-ms-interpolation-mode': 'nearest-neighbor',
          }}
        />
      </Box>
      <h3>Специализируется на стойкости и ближнем бое.</h3>
      <p>
        <b>Восстановление</b>: Будет восстанавливать ваше здоровье тем сильнее,
        чем больше урона вы получили.
      </p>
      <p>
        <b>Кровавый вал</b>: Открывается от 150{' '}
        <i>
          <font color="red">ед. крови</font>
        </i>
        , увеличивает ваше сопротивление оглушению, физическому и стамина урону.
        Вы не можете стрелять пока активна способность.
      </p>
      <p>
        <b>Ударная волна</b>: Открывается от 250{' '}
        <i>
          <font color="red">ед. крови</font>
        </i>
        , позволяет вам сотрясать землю под ногами, чтобы оглушить и оттолкнуть
        окружающих врагов.
      </p>
      <p>
        <b>Кровавый драйв</b>: Открывается от 250{' '}
        <i>
          <font color="red">ед. крови</font>
        </i>
        , дает вам прибавку к скорости на короткое время.
      </p>
      <p>
        <b>Кровавый вал II</b>: Открывается от 400{' '}
        <i>
          <font color="red">ед. крови</font>
        </i>
        , увеличивает весь урон в ближнем бою на 10.
      </p>
      <p>
        <b>Неудержимая сила</b>: Открывается от 600{' '}
        <i>
          <font color="red">ед. крови</font>
        </i>
        , будучи включенным, позволяет открывать двери при столкновении, даже не
        имея доступа. Вас также не могут толкнуть или тащить, пока способность
        активна.
      </p>
      <p>
        <b>Демоническая хватка</b>: Открывается от 800{' '}
        <i>
          <font color="red">ед. крови</font>
        </i>
        , позволяет вам отправить к цели демоническую руку. В зависимости от
        интента, disarm/grab, вы оттолкнете/притянете цель.
      </p>
      <p>
        <b>Полная сила</b>
        <Divider />
        <b>Рывок</b>: Вы получаете способность делать рывок в вашу цель,
        разрушая и отталкивая все, во что врежетесь.
      </p>
      <Button content="Гаргантюа" onClick={() => act('gargantua')} />
    </Section>
  );
};

export const DantMenu = (props, context) => {
  const { act, data } = useBackend(context);
  const { dantalion } = data;
  return (
    <Section title="Данталион">
      <Box textAlign="center">
        <img
          height="256px"
          width="256px"
          src={`data:image/jpeg;base64,${dantalion}`}
          style={{
            '-ms-interpolation-mode': 'nearest-neighbor',
          }}
        />
      </Box>
      <h3>Специализируется на порабощении и иллюзиях.</h3>
      <p>
        <b>Подчинение</b>: Открывается от{' '}
        <i>
          150 <font color="red">ед. крови</font>
        </i>
        , подчиняет цель вашей воле, требует от вас не шевелиться во время
        порабощения. Не работает на носителей импланта защиты разума и на уже
        порабощенных существ.
      </p>
      <p>
        <b>Предел рабов</b>: Вы можете поработить максимум одного раба за раз.
        Количество рабов будет расти при достижении{' '}
        <i>
          400 <font color="red">ед. крови</font>
        </i>
        ,{' '}
        <i>
          600 <font color="red">ед. крови</font>
        </i>{' '}
        и полной силы с максимумом в 4 раба.
      </p>
      <p>
        <b>Телепатическая связь</b>: Открывается от{' '}
        <i>
          150 <font color="red">ед. крови</font>
        </i>
        , позволяет вам разговаривать с вашими рабами, ваши рабы также могут
        отвечать вам.
      </p>
      <p>
        <b>Подпространственный обмен</b>: Открывается от{' '}
        <i>
          150 <font color="red">ед. крови</font>
        </i>
        , позволяет вам меняться местами с целью.
      </p>
      <p>
        <b>Умиротворение</b>: Открывается от{' '}
        <i>
          250 <font color="red">ед. крови</font>
        </i>
        , позволяет вам успокоить цель, отобрав у нее возможность нанести вред
        кому-либо в течение 40 секунд.
      </p>
      <p>
        <b>Приманка</b>: Открывается от{' '}
        <i>
          400 <font color="red">ед. крови</font>
        </i>
        , ненадолго делает вас невидимым и создает вашу копию обманку.
      </p>
      <p>
        <b>Сплотить рабов</b>: Открывается от{' '}
        <i>
          600 <font color="red">ед. крови</font>
        </i>
        , снимает с близстоящих рабов любые оглушающие эффекты.
      </p>
      <p>
        <b>Кровавые узы</b>: Открывается от{' '}
        <i>
          800 <font color="red">ед. крови</font>
        </i>
        , связывает вас со всеми окружающими вас рабами, если кто-либо в связке
        получает урон, то он делится между всеми остальными. Если раб уходит
        далеко от вас, то вы теряете связь с ним.
      </p>
      <p>
        <b>Полная сила</b>
        <Divider />
        <b>Массовая истерия</b>: создает массовую галлюцинацию, ослепив всех
        поблизости, а затем заставив окружающих видеть друг в друге различных
        животных.
      </p>
      <Button content="Данталион" onClick={() => act('dantalion')} />
    </Section>
  );
};

export const BestMenu = (props, context) => {
  const { act, data } = useBackend(context);
  const { bestia } = data;
  return (
    <Section title="Бестия">
      <Box textAlign="center">
        <img
          height="256px"
          width="256px"
          src={`data:image/jpeg;base64,${bestia}`}
          style={{
            '-ms-interpolation-mode': 'nearest-neighbor',
          }}
        />
      </Box>
      <h3>Специализируется на превращении и добыче трофеев.</h3>
      <p>
        <b>Посмотреть трофеи</b>: Открывается от{' '}
        <i>
          150 <font color="red">крови</font>
        </i>
        , позволяет вам проверить количество трофеев, а также все пассивные
        эффекты, что они дают.
      </p>
      <p>
        <b>Препарирование</b>: Открывается от{' '}
        <i>
          150 <font color="red">крови</font>
        </i>
        , вдобавок к крови позволяет вам поглощать органы в качестве трофеев для
        расширения ваших возможностей.
      </p>
      <p>
        <b>Предел препарирований</b>: за раз вы можете поглотить максимум один
        орган. Предел будет увеличиваться при достижении{' '}
        <i>
          600 <font color="red">крови</font>
        </i>{' '}
        и полной силы с максимумом в три органа.
      </p>
      <p>
        <b>Зараженный трофей</b>: Открывается от{' '}
        <i>
          150 <font color="red">крови</font>
        </i>
        , позволяет вам оглушать противников с безопасной дистанции, заражая их
        могильной лихорадкой.
      </p>
      <p>
        <b>Рывок</b>: Открывается от{' '}
        <i>
          250 <font color="red">крови</font>
        </i>
        , позволяет быстро сократить расстояние между вами и целью или сбежать
        из опасной ситуации.
      </p>
      <p>
        <b>Пометить добычу</b>: Открывается от{' '}
        <i>
          250 <font color="red">крови</font>
        </i>
        , позволяет вам отметить жертву, уменьшив ее скорость и заставив ее
        путаться в ногах.
      </p>
      <p>
        <b>Метаморфоза - Летучие мыши</b>: Открывается от{' '}
        <i>
          400 <font color="red">крови</font>
        </i>
        , позволяет вам обратиться смертоносными космическими летучими мышами.
      </p>
      <p>
        <b>Анабиоз</b>: Открывается от{' '}
        <i>
          600 <font color="red">крови</font>
        </i>
        , древняя техника, позволяющая вам залечить почти любые ранения за счет
        сна в гробу.
      </p>
      <p>
        <b>Призыв летучих мышей</b>: Открывается от{' '}
        <i>
          600 <font color="red">крови</font>
        </i>
        , позволяет вам призвать космических летучих мышей для помощи в бою.
      </p>
      <p>
        <b>Полная сила</b>
        <Divider />
        <b>Метаморфоза - Гончая</b>: Позволяет вам обратиться в совершенную
        форму блюспейс сущности, завладевшей вашей душой.
      </p>
      <Button content="Бестия" onClick={() => act('bestia')} />
    </Section>
  );
};
