// Падежи русского языка
#define NOMINATIVE 1 // Именительный: кто это? Клоун и ассистуха. Что это? Кусок пирога.
#define GENITIVE 2 // Родительный: откусить кусок от кого? От клоуна и ассистухи. Откусить кусок от чего? От куска пирога.
#define DATIVE 3 // Дательный: дать полный доступ кому? Клоуну и ассистухе. Идти к чему? Идти к дому.
#define ACCUSATIVE 4 // Винительный: обвинить кого? Клоуна и ассистуху. Читаю что? Читаю книгу.
#define INSTRUMENTAL 5 // Творительный: возить по полу кем? Клоуном и ассистухой. Бью чем? Бью монтировкой.
#define PREPOSITIONAL 6 // Предложный: прохладная история о ком? О клоуне и об ассистухе. Лежать на чём? Лежать на диване.
