/datum/affiliate/tiger
	name = "Tiger Cooperative"
	desc = "Вы - послушник культа генокрадопоклонников и член организации Tiger Cooperative. \n\
			Вышестоящие братья определили ваши задачи на станции NanoTrasen, не опозорьте их и явите миру новое дитя генокрада! \n\
			Как вам стоит работать: не раскрывайте свое присутсвие и присутствие генокрада, позаботьтесь о его успешном внидрении. \n\
			Особые условия: братья по вере не пользуются оружием дальнего боя, предпочитая стимуляторы и энергомечи. \n\
			Стандартные цели: Предоставить тело генокраду, принять особое ритуальное вещество, разобраться с указанны еретиком, вернуться к братьям."

	objectives = list(// заразить яйцом гены,
					// бахнуть дозу,
					/datum/objective/maroon,
					/datum/objective/escape
					)
