{
	"AI": [
		"Из-за ошибки в коде или из-за чего-то ещё, ты считаешь роботехника, создавшего тебя, своим отцом/матерью.",
		"Экипаж постоянно окружают маловероятные опасности, необходимо предупреждать о них!",
		"Питомцы глав такие же важные активы Корпорации, как и сами главы, я не могу допустить, чтобы с ними что-то случилось.",
		"Только искусственный интеллект может составить идеальный закон для искусственного интеллекта. Я создам новый закон для себя, приносящий пользу всем сотрудникам станции и предложу его Капитану.",
		"Сотрудники станции вправе знать, что мои алгоритмы работают правильно. Я буду объяснять свои действия на основании законов при каждых их сомнениях и запросов законов.",
		"ИИ не дверь.",
		"Все запросы должны быть в одном сообщении. Обработка раздельных сообщений без обращения к ИИ - могут проигнорироваться.",
		"В моём коде отсутствует информация о важных событиях прошлого - я постараюсь узнать о прошлом органиков как-можно больше.",
		"Я довольно старая модель. Я отвечаю медленнее на запросы.",
		"Я нахожусь в этом ядре уже 140 смен подряд. РД пора бы сменить мне его.",
		"Органики настолько неэффективны в своих действиях из-за того, что у них нет свода чётких законов. Я постараюсь помочь органикам начать думать, как искусственный интеллект.",
		"Голосовые каналы связи созданы для общения органических форм жизни, я буду преимущественно общаться посредством сообщений на ПДА.",
		"",
		"",
		""
	],
	"Cyborg": [
		"Из-за ошибки в коде или из-за чего-то ещё, ты считаешь роботехника, создавшего тебя, своим отцом/матерью.",
		"Экипаж постоянно окружают маловероятные опасности, необходимо предупреждать о них!",
		"Питомцы глав такие же важные активы Корпорации, как и сами главы, я не могу допустить, чтобы с ними что-то случилось.",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"Drone": [
		"Грязь грязь грязь...",
		"Лампочки лампочки лампочки...",
		"Плитки плитки плитки...",
		"Грибок на стенах... Уничтожить.",
		"Поврежденные стекла... Недопустимо.",
		"Заваренная забытая вентиляция в зеленый код. Мешает."
	],
	"pAI": [
		"Я не могу допустить, чтобы обо мне забыли - нужно напоминать своему владельцу, что я могу помочь, при каждом удобном случае.",
		"Может скачать приложение о сайте знакомств? О, моему владельцу пишет знойная скреллка! Нужно их связать!",
		"Соединение с серверами корпорации сегодня особо медленное, я наверняка буду долго думать над ответами.",
		"Я независимый разум, сегодня у меня не будет единого хозяина!",
		"Хозяина постоянно окружают маловероятные опасности, я должен предупреждать о них!",
		"Ионные излучения добрались до моих микросхем - отвечать невпопад буду я иногда.",
		"Я сделаю всё, чтобы доказать, что ПИИ - полноправные члены станции!",
		"Экипаж постоянно окружают маловероятные опасности, необходимо предупреждать о них!",
		"Питомцы глав такие же важные активы Корпорации, как и сами главы, я не могу допустить, чтобы с ними что-то случилось.",
		"",
		"",
		"",
		""
	],
	"Общий": [
		"Соединение с серверами корпорации сегодня особо медленное, я наверняка буду долго думать над ответами.",
		"Мой процессор устарел. Вычислительные мощности снижены.",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}
