{
	"Bartender": [
		"Сегодня стоит сделать самый сложный напиток и обязательно угостить им каждого!",
		"Не наливайте никому из СБ",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"Botanist": [
		"Каждому отделу нужен свой питомец который идеально описал бы их работу, даже если есть один, нужен ещё!",
		"Для здоровья нет ничего лучше бани, да с хорошим веником... Но на станции её нет. Нужно исправить ситуацию.",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"Chef": [
		"Сегодня стоит сделать самое сложное блюдо и обязательно угостить им каждого!",
		"На станции всегда есть пара-тройка мышей, что прячутся в вентиляции и только ждут момента, чтобы съесть ваш сыр. Почему бы не завести кота?",
		"Каждому отделу нужен свой питомец который идеально описал бы их работу, даже если есть один, нужен ещё!",
		"Испеките торто-кота и не позволяйте никому его съесть, ведь он тоже живой!",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"Janitor": [
		"Какой же бардак на станции. Нужно держать всё в чистоте и прибранным. Все вещи должны быть разложены по местам!",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"Librarian": [
		"Я репортер wetskrell.nt, пора заснять новый материал для выпуска!",
		"Я комментатор и режиссер! Всё что происходит на станции - не должно пройти мимо меня!",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"Chaplain": [
		"Найдите свое священное животное и приведите его в церковь.",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"Clown": [
		"Вам не кажется, что одного клоуна на этой станции слишком мало? Вы явно не справляетесь, пора вызывать хонксквад!",
		"Зачем нужна система труб карго, если не для пранков? Отправьте себя по ней в какой-нибудь отдел.",
		""
	],
	"Mime": [
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"Barber": [
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"Explorer": [
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		""
	],
	"Общий": [
	"Я очень давно на этой должности, слишком давно! Я хочу повышения до заместителя начальника или старшего сотрудника. Я этого заслужил!",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		""
	]
}
