{
	"Civilian": [
		"Сегодня вы точно не бесполезный! Получите работу от ГП и сохраните её до конца смены"
	],
	"Общий": [
		"Моя жизнь слишком серая и однообразная, нужно добавить красок! Прическа совсем не модная, одежда как под копирку... Нельзя же так!",
		"Получить медаль за достойную работу на своей должности!",
		"Нашей станции не хватает уюта и мест отдыха. Надо это исправить!",
		"Я стою намного больше, чем мне платят! Нужно добиться повышения зарплаты.",
		"Мне одиноко... Нужно найти друзей...",
		"Меня гнетёт одиночество... Хочу друга...",
		"Я слишком правильный! Это бесит!!! Мне срочно нужна вредная привычка.",
		"Пора покутить и завести интрижки!",
		"Надоело всё... Хочу кутить!",
		"Я чувствую себя еще тем интриганом. Может получится кого-то поссорить?",
		"Как же хочется совершить пакость!",
		"Вы устали смена за сменой торчать на этом скучном куске металла. Отправьтесь за его пределы.",
		"Тут очень тускло! Надо закатить девичник/мальчишник!",
		"Любви все возрасты покорны. Признайтесь в любви роботу и попросите священника вас обручить.",
		"Вы долго жили в нищете и считаете, что пришло время всё изменить.",
		"Тебе хочется сделать чей то день ярче, обними кого нибудь!",
		"Тебе хочется получить от кого нибудь обнимашки!",
		"Самое время выпить!",
		"Выплесни свою душу, нарисуй граффити!",
		"Тебе хочется погладить Йана!",
		"Вы слишком устали от трезвой жизни... Вы больше не проведете и минуты не в алкогольном состоянии!",
		"Хм... Вы заметили, что вы слишком одиноки, найдите себе друга, а может и кого-то больше, чем просто друг...",
		"Вероятно, тебе интересно как работает (любое название отдела кроме собственного) отдел, попробуй разузнать о нём побольше!",
		"У тебя сегодня особенный день - твой день рождения. Отпразднуй как следует!",
		"Мне доверили питомца отдела! Разве он не милашка? Нужно сделать так, чтобы ему было комфортно.",
		"У кого-то сегодня день рождения, найдите его и помогите отпраздновать или устройте сюрприз!",
		"Как вообще мыши попали на космическую станцию? Убейте всех этих ужасных вредителей пока они ничего не испортили!",
		"Вдали от дома ты страдаешь. Скука и тоска преследует тебя. Может в этот день стоит найти себе любовь, что согреет тебя теплыми объятиями в такой прохладный день?",
		"Вы фанат активных видов спорта, устройте себе пару боёв на голодеке.",
		"Ваш отдел должен сиять! Убирайтесь в нём, поддерживайте красоту, добавьте цветы в декор! Вы любите это и другие полюбят!",
		"Вы с [random_crew] старые друзья, вы уже давно работаете вместе и многое повидали на космических станциях корпорации NT.",
		"Собрать все фигурки на станции.",
		"Курить люблю пиздец. Не выпускайте зажжённую сигарету изо рта до конца смены даже под страхом декомпрессии.",
		"Кофеман. У вас нет никаких проблем с кофеином! По крайней мере пока вы потребляете кофеин не реже чем раз в 5 минут.",
		"Кажется, я влюбился в [random_crew], но боюсь признаться.. Я должен завоевать его сердце!",
		"ОПЯТЬ РАБОТА? Вы работаете уже 81 день без выходных, ещё немного и у вас будет нервный срыв. Делайте что-угодно кроме своей работы. Ворвитесь с двух ног на очередную смену и раскачайте тусу по полной программе. И главное: ни слова о работе.",
		"Вы работаете три дня без перерыва и зарплаты. Ворвитесь на кухню и заберите себе весь хлеб и никому его не отдавайте.",
		"Вы давно мечтаете прикоснуться к мягкому пушистому хвостику. Пришла пора это сделать.",
		"Вам очень нравится гладить кошек, но ещё больше вам хотелось бы погладить таяру, но им подобное не нравится. Может быть есть какой-то способ получить их расположение?",
		"Нет ничего прекраснее, чем съесть старую-добрую Лазанью.",
		"Ты чувствуешь симпатию к коммунистам. Попробуй собрать недовольных своей работой людей и обсудить их проблемы.",
		"Зачем нужна система труб карго, если не для пранков? Отправьте себя по ней в какой-нибудь отдел.",
		"Найдите собутыльника и напейся с ним до беспамятства.",
		"",
		"",
		"",
		"",
		"",
		""
	]
}
