{
	"not_complete_phrases": [
		"You couldnt do it? What the hell are you even doing there?",
		"It's a shame, we could've helped each other",
		"Why did you even take this on?",
		"Our department will surely be underpaid for being behind schedule",
		"Listen here, moron, if you mess with our plans again, I'll pay you a visit and disembowel your dog",
		"Observing. The delivery request has been ignored by the station crew. The list of perpetrators was identified. The Department will be notified about this. ",
		"We are sure as shit getting sacked this term. Hey, which one of you can I stay with for a couple of months?",
		"Section 4 first, then revisors, and now you? I need to feed my family, but what do YOU know about such matters.",
		"Hey, boys! Put yourselves together, our work is stalling because of you.",
		"Good work. Mister S will appreciate your efforts.",
		"I'LL MAKE SURE YOU BECOME UNEMPLOYED THE NEXT WEEK YOU BRAINDEAD LUMP OF MEAT",
		"Cheers, dudes, I really didn't want to work today. ",
		"Shit. It seems like we're not getting our delivery today. "
	],

	"good_complete_phrases": [
		"All set, good work. ",
		"We got everything we ordered, very good. ",
		"Could've thrown in a little souvenir from the station. Eh, Whatever, this will do.",
		"The shipment is safe and sound, glory to the cargo-techs! ",
		"Our boss told us he had received the package. He's content, and so are we.",
		"You're on time, don't worry. Everything's in place, everything's intact. ",
		"Good work, fellows, you helped us out a lot. If you need anything, say you're from Gregg. ",
		"OOOOOOOOOOOOOOOOOOOOOoooooooooooooooooo!! ",
		"The cargo has been received in supreme condition. Wish it was always like that, and not how it usually goes... ",
		"Delivery received, but one of our fools got their finger torn off during unpacking.",
		"Finally, a man at work.",
		"I'll report your helpful work to the higher ups. ",
		"AVE CARGONIA",
		"Gotta work again…",
		"I won't forget this, my dudes. This delivery might even get me a promotion. ",
		"It actually came, it's actually intact. We were getting worried for a moment there.",
		"Hurry up next time, you just barely made it in time. ",
		"Work faster next time, our schedule is tight. ",
		"Where's the damn beer?? Could you not put it in???? ",
		"Well, I ain't getting fired today."
	],

	"fast_complete_phrases": [
		"DAMN YOU GOOD, MAN",
		"Much respect for the speed, by the way.",
		"You did really good, excellent job, guys. ",
		"CARGONIA AVE",
		"We'll provide a discount on some of our merchandise for your efficiency. ",
		"You are to be rewarded for your urgency. ",
		"In a blink of an eye, that's some skill. ",
		"Hey, catch me later, I'll buy you a beer. ",
		"You guys are MAD, can I work for you? ",
		"I TOLD my guys you weren't going to let us down. ",
		"I'll provide you with a discount for your efforts. ",
		"You can expect some bonuses, you did good. ",
		"You can when you want to. ",
		"By the way, is it true one can hook up with a Skrell on your station? ",
		"I always knew you were not going to disappoint. ",
		"The samples came in right as the tests were about to begin, expect a bonus.",
		"YEEEEEEEEEAAAAAH",
		"On behalf of the department, I thank you for your services." ,
		"Alright, I'll give you a little something for your hard work."
	],

	"content_missing_phrases": [
		"The package was received, but I'm pretty sure we ordered more than that. Whatever, we can still work with this. ",
		"You were penalized for under-delivery. Pay attention to what you are sending.",
		"This is not enough, unfortunately. I'll have to reduce your pay. ",
		"This won't do, guys, where's the rest of it? Ah screw it, it is what it is. ",
		"There's something missing. Not good." ,
		"STOP GETTING WASTED, WE ARE TRYING TO DO OUR JOBS HERE. ",
		"You were better off not sending the package at all. Well then.. ",
		"Do I really have to report your stupidity? ",
		"I can report you and you'll all get sacked.",
		"My wife's cousin works at the Department, do you want problems, huh? ",
		"The Boss told us we must accept the delivery as is. He also told us you're a bunch of imbeciles. ",
		"The Boss says we can't pay the full price for the delivery, he's gonna cut your payment." ,
		"Not enough, not good. ",
		"This ain't gonna do. We'll take a part of the payment for ourselves. ",
		"Is there anyone capable of doing simple maths in your department? "
	],

	"departure_mismatch_phrases": [
		"The shipment had to come the roundabout way, but whatever. ",
		"The package went past us and ended up at the navy fleet's party. Oopsie. ",
		"COME ON MAAAAAAAAAAAAAN",
		"Do y'all need to be taught how to use a tagger? ",
		"The delivery came in with a delay, we're reducing your reward. ",
		"We lost a lot of money because of you taking your sweet time. ",
		"Does your station only employ monkeys in cargo? ",
		"No wonder everyone says you're stupid. ",
		"HOW DOES THIS EVEN HAPPEN????? ",
		"Tell us the your address, we'll send a first-grade math book your way. ",
		"Use your tagger to mark your packages, please. ",
		"Penalized, the delivery took too long. ",
		"Well, we didn't need the cargo anymore by the time it came in. "
	],
	"content_mismatch_phrases": [
		"What the hell did you send us?",
		"Why",
		"I'm pretty sure you have a dumpster somewhere. ",
		"Space is large enough, you can dump your stuff there. Why send it here? ",
		"…",
		"Who's this even for?",
		"I don't know what happened there, but poor Joe lost his arm in result",
		"We're going to write a collective complaint against your crew ",
		"I don't know why we need this here, but this crate is very convenient to play bones on. Cheers. ",
		"Thanks for crate, guys! I've been thinking of getting one for my garage for a long time. How did you know?",
		"Errmm. ",
		"Are you sure this is for us? ",
		"We didn't even order anything",
		"Amount discrepancy, I have to cut a part your pay. ",
		"Hey, guys, You might've counted it wrong.",
		"There is not enough here, where is the rest?",
		"Not the same amount as we ordered.",
		"You're sabotaging our work."
	]
}
