{
	"not_complete_phrases": [
		"Не вышло? Вы чем там занимаетесь вообще?",
		"Жаль, мы могли бы помочь друг другу.",
		"Зачем вы вообще брались за это?",
		"Нашему отделу наверняка урежут зарплату за отставание в графике.",
		"Слушай сюда, кретин, ещё раз вы будете срывать наши планы, я приду к тебе домой и убью твою собаку.",
		"Наблюдение. Запрос на доставку проигнорирован экипажем станции. Круг лиц определён, Ведомство узнает об этом.",
		"В этом квартале нас точно сократят. Эй, к кому из ваших можно подселиться на пару месяцев?",
		"Сначала четвёртый отдел, потом ревизоры, а теперь ещё и вы? Мне семью кормить надо, хотя ВАМ то какое дело.",
		"Мужики, соберитесь там, у нас работа стоит из-за вас.",
		"Хорошая работа, агент. Мистер S. оценит ваши труды.",
		"Я ПРИМУ ВСЕ МЕРЫ ЧТОБЫ ТЫ УЖЕ ЧЕРЕЗ НЕДЕЛЮ СТАЛ БЕЗРАБОТНЫМ БЕЗМОЗГЛЫЙ ТЫ КУСОК МЯСА.",
		"Мужики, спасибо, а то так работать не хотелось.",
		"Хреново. Сегодня без доставки, походу."
	],

	"good_complete_phrases": [
		"Всё на месте, хорошая работа.",
		"Всё пришло, что заказывали, класс.",
		"Не ну могли бы и сувенир со станции положить какой. Ладно, сойдёт.",
		"Груз целый и невредимый, слава карго-техам!",
		"Босс велел передать что получил посылку, он рад. Ну и мы тоже.",
		"Вы успели, не переживайте. Всё на месте, всё целое.",
		"Хорошая работа, парни, очень помогли. Если что будет нужно у нас, скажите, что вы от Грэга.",
		"OOOOOOOOOOOOOOOOOOOOOoooooooooooooooooo!!",
		"Груз прибыл в целостности и сохранности, всегда бы так, а не как обычно...",
		"Доставку приняли, только у нас одному дурачку палец оторвало во время вскрытия контейнера.",
		"Наконец-то, мужчина за работой.",
		"Я отрапортую куда надо, что вы нам очень помогли сегодня.",
		"АВЕ КАРГОНИЯ!!!!!!!!!!!!!",
		"Опять вкалывать...",
		"Мужики, век не забуду, эта доставка поможет мне получить должность получше.",
		"Реально пришло, реально всё на месте. А мы уже начали волноваться.",
		"В следующий раз поторопитесь, едва успели.",
		"Работайте быстрее в следующий раз, у нас график срывается.",
		"А пиво где?? Вы чё его не положили???",
		"Ну, сегодня меня не уволят."
	],

	"fast_complete_phrases": [
		"МУЖИК НУ ТЫ КРУТ.",
		"Кстати, за скорость отдельный респект.",
		"Реально хорошо справились, молодцы, парни.",
		"КАРГОНИЯ АВЕ!!!!",
		"За скорость дам скидку на часть продукции.",
		"За спешку вам полагается отдельная надбавка.",
		"Я глазом моргнуть не успел, вот это уровень.",
		"Кстати, я должен тебе пиво.",
		"Во вы ЛЮТЫЕ, а можно к вам на работу?",
		"А я говорил своим что вы не подведёте.",
		"Сделаю вам скидку за труды.",
		"Можете рассчитывать на поблажки, хорошо потрудились.",
		"Умеете же, когда хотите.",
		"Кстати, а правда, что у вас там со скреллками можно познакомиться?",
		"Всегда знал, что вы не подведёте.",
		"Образцы пришли прямо к началу испытаний, ожидайте надбавки.",
		"YEEEEEEEEEAAAAAH",
		"От лица отдела выражаю огромную благодарность за труды.",
		"Мужички, за хлопоты так и быть, скину чуток сверху."
	],

	"content_missing_phrases": [
		"Посылка прибыла, не вижу всё, что мы просили. Ладно, с этим тоже можно работать.",
		"Вычет за отсутствие комплекта. Следите за тем, что вы отправляете.",
		"Этого мало, увы, вычитаю часть прибыли.",
		"Не подойдёт парни, где остальное? А хрен с ним, что есть то есть.",
		"Чего-то не хватает, непорядок.",
		"Э ВЫ ТАМ БУХАТЬ ПРЕКРАЩАЙТЕ ТО, МЫ ЗДЕСЬ РАБОТУ ПЫТАЕМСЯ ВСЁ-ТАКИ ВЫПОЛНЯТЬ.",
		"Лучше бы вы это вообще не отправляли. Ну что ж...",
		"Мне чё рапорт сесть писать о вашем раздолбайстве?",
		"Я могу сообщить куда надо и вас всех поувольняют.",
		"У меня двоюродный брат жены работает в Ведомстве, ты проблем хочешь?",
		"Босс сказал что надо принять так. А ещё он сказал что вы дебилы.",
		"Босс толкует, что мы не можем принять за полную стоимость, он вам выдачу урежет." ,
		"Не хватает, плохо.",
		"Так никуда не годится. Мы удержим часть прибыли себе.",
		"Вы там на пальцах считаете что ли?"
	],

	"departure_mismatch_phrases": [
		"Только сначала груз совершил крюк через ещё два места, ну да ладно.",
		"Посылка прошла мимо нас и отправилась на корпоратив высшего офицерского состава флота. Ой-ёй.",
		"НУ МУЖИИИИИИИИИК.",
		"Вас научить пользоваться таггером?",
		"Доставка задержалась, мы вычитаем вам награду.",
		"Мы потеряли большую прибыль из-за вашей нерасторопности.",
		"У вас там одни мартышки что ли в снабжении?",
		"Не зря говорят, что вы тупые.",
		"ДА КАК ТАК МОЖНО БЫЛО ТО ВООБЩЕ??????",
		"Назовите обратный адрес, я вам учебник начальных классов подарю.",
		"Таггером метки проставляйте нормально.",
		"Вычет, груз задержался.",
		"Ну, пока посылка ехала, она уже оказалась не нужна."
	],
	"content_mismatch_phrases": [
		"Нахрена вы это отправили?",
		"Зачем.",
		"У вас мусорка вообще-то есть.",
		"Космос большой, мусорите туда, зачем мусорить сюда?",
		"…",
		"Это кому вообще?",
		"Не знаю чё там было, но бедолага Джо лишился руки в результате.",
		"Мы будем писать коллективную жалобу на вашу шайку.",
		"Не знаю зачем нам это, но на ящике удобно играть в домино, спасибо.",
		"Спасибо за ящик мужики, давно думал в гараж такой поставить. Как узнали?",
		"Эмммм.",
		"Это точно нам?",
		"Мы даже не заказывали.",
		"Несоответствие количества, вынужден вычеркнуть часть прибыли.",
		"Мужики, вы обсчитались.",
		"Здесь не хватает вроде, а где остальное?",
		"Не то количество, какое надо.",
		"Вы срываете нам работу."
	]
}
