
// MARK: Papers
/obj/item/paper/lazarus/guard_log
	desc = "Похоже на вырванный лист из журнала записей поста охраны, на обратной стороне бумаги дата: 02.06.2567"
	info = "<h1>Сержант Барнс</h1><hr>КПП-1.<br>\
			03:10 — грузовой транспорт, разрешение имеется.<br>\
			05:40 — инженерная бригада, пропущены.<br>\
			08:15 — начальство приказало не пропускать никого в сектор.<br>\
			08:47 — поступил приказ снять пост.<br>\
			09:05 — пост покинут."

/obj/item/paper/lazarus/last_survivor
	desc = "Лист бумаги в пыли."
	info = "Дата 15 Месяц 9 Год 2568 <hr>Нас было шестеро на этом наблюдательном посту, включая меня.<br><br>\
			Двое из них предали нас. Они направили оружие против собственных товарищей. Я не знаю, по какой причине.<br><br>\
			Мы вступили в бой прямо внутри базы. Трое солдат погибли. Я пытался удерживать позицию и ждать помощи, но после взрыва главный выход оказался завален. Связи с внешним миром больше нет.<br><br>\
			Предатели сбежали. Я не знаю живы они или нет.<br><br>\
			Нас оставили здесь.<br><br>\
			Пути наружу больше нет. Надежды на помощь тоже нет.<br><br>\
			Я последний в живых. Я не стану ждать смерти в этой темноте.<br><br>\
			Если кто-нибудь найдёт эту запись, пусть помнит: погибшие здесь выполнили свой долг.<br><br>\
			Прощайте."

/obj/item/paper/lazarus/route_note
	desc = "Мятый лист бумаги в пыли и мазуте."
	info = "НЕ ЗАБЫТЬ<hr>Последнюю партию больше через старую дорогу не тащим. Патрули начали ходить дальше на север, не знаю что они там вынюхивают, но лучше не светиться<br><br>\
			Новый маршрут: старая тропа — озеро — метеостанция — восточный сектор<br><br>\
			На метеостанции людей почти не бывает. Если дверь закрыта — ждать до следующего окна связи.<br><br>\
			Груз прятать не возле станции, а дальше по тропе. В прошлый раз кто-то полез в старый склад и едва не нашёл следы.<br><br>\
			И ещё:<br>\
			Если начинается дождь — не выходить<br>\
			В прошлый раз один из наших решил, что это обычная гроза. Через десять минут кожа на руках пошла пятнами, а металлический контейнер пришлось выбросить.<br>\
			Не знаю, что там творится с атмосферой, но метеорологи явно что-то скрывают.<br><br>\
			К."

/obj/item/paper/lazarus/meteo_report
	desc = "Лист бумаги в идеальном состоянии."
	info = "<h1>МЕТЕОРОЛОГИЧЕСКАЯ СТАНЦИЯ #1-LV624<br>ОТЧЕТ О СОСТОЯНИИ АТМОСФЕРНЫХ ОСАДКОВ</h1><hr>\
			Дата: 21.06.2567<br>\
			Ответственный наблюдатель: Джордж Уиззерсмит<br><br>\
			За последний период наблюдений в северо-восточном секторе неоднократно зарегистрированы осадки с повышенной кислотностью.<br><br>\
			Обычный показатель pH дождевой воды составляет 5,4-5,8. Во время отдельных эпизодов показатель снижался до 3,1-3,6<br><br>\
			Анализ проб выявил повышенное содержание сульфат- и нитрат-ионов. Предполагается, что явление связано с присутствием в атмосфере аэрозольных соединений неизвестного происхождения.<br><br>\
			Несмотря на повышенную кислотность осадков, заметного ущерба местной флоре не обнаружено. Растительность региона демонстрирует высокую устойчивость к подобным условиям, предположительно вследствие длительной адаптации.<br><br>\
			Наибольшую опасность осадки представляют для человека, металлических конструкций и оборудования.<br><br>\
			Рекомендуется избегать нахождения под открытым небом во время осадков с pH ниже 3,5.<br><br><br>\
			Примечание: причина периодического повышения кислотности атмосферы пока не установлена. Продолжить сбор проб."

/obj/item/paper/lazarus/meteo_daily
	desc = "Лист бумаги, в идеальном состоянии."
	info = "<h1>АВТОМАТИЧЕСКИЙ СУТОЧНЫЙ ОТЧЕТ</h1><hr>\
			20.06.2567.<br>\
			Температура: 27,4 °C<br>\
			Влажность: 91%<br>\
			Давление: 748 мм рт. ст.<br>\
			Ветер: 6,2 м/с, северо-восточное направление<br>\
			Осадки: 14,7 мм<br>\
			Средний pH осадков: 5,2<br>\
			Грозовая активность: отсутствует<br><br><h1>"

/obj/item/paper/crumpled/bloody/lazarus/strange_records
	desc = "Мятый лист бумаги. От одного вида на него у вас начинается головокружение."
	info = "<h1>ПОМОГИТЕ МНЕ</h1><hr><br>\
			<large><large><b>ПОМОГИТЕМНЕ МНЕ ПОМОГИТЕМНЕПОМОГИТЕ МНЕПОМОГИТЕМНЕ ПОМОГИТЕПОМОГИТЕПОМОГИТЕ МНЕПОМОГИТЕПОМОГИТЕМНЕ ПОМОГИТЕПОМОГИТЕПОМОГИТЕ МНЕПОМОГИТЕМНЕМНЕ ПОМОГИТЕМНЕМНЕПОМОГИТЕ ПОМОГИТЕМНЕ МНЕ ПОМОГИТЕМНЕПОМОГИТЕ МНЕПОМОГИТЕМНЕ ПОМОГИТЕПОМОГИТЕПОМОГИТЕ МНЕПОМОГИТЕПОМОГИТЕМНЕ ПОМОГИТЕПОМОГИТЕПОМОГИТЕ МНЕПОМОГИТЕМНЕМНЕ ПОМОГИТЕМНЕМНЕПОМОГИТЕ ПОМОГИТЕМНЕ МНЕ ПОМОГИТЕМНЕПОМОГИТЕ МНЕПОМОГИТЕМНЕ ПОМОГИТЕПОМОГИТЕПОМОГИТЕ МНЕПОМОГИТЕПОМОГИТЕМНЕ ПОМОГИТЕПОМОГИТЕПОМОГИТЕ МНЕПОМОГИТЕМНЕМНЕ ПОМОГИТЕМНЕМНЕПОМОГИТЕ ПОМОГИТЕМНЕ МНЕ ПОМОГИТЕМНЕПОМОГИТЕ МНЕПОМОГИТЕМНЕ ПОМОГИТЕПОМОГИТЕПОМОГИТЕ МНЕПОМОГИТЕПОМОГИТЕМНЕ ПОМОГИТЕПОМОГИТЕПОМОГИТЕ МНЕПОМОГИТЕМНЕМНЕ ПОМОГИТЕМНЕМНЕПОМОГИТЕ ПОМОГИТЕМНЕ МНЕ ПОМОГИТЕМНЕПОМОГИТЕ МНЕПОМОГИТЕМНЕ ПОМОГИТЕПОМОГИТЕПОМОГИТЕ МНЕПОМОГИТЕПОМОГИТЕМНЕ ПОМОГИТЕПОМОГИТЕПОМОГИТЕ МНЕПОМОГИТЕМНЕМНЕ ПОМОГИТЕМНЕМНЕПОМОГИТЕ ПОМОГИТЕМНЕ МНЕ ПОМОГИТЕМНЕПОМОГИТЕ МНЕПОМОГИТЕМНЕ ПОМОГИТЕПОМОГИТЕПОМОГИТЕ МНЕПОМОГИТЕПОМОГИТЕМНЕ ПОМОГИТЕПОМОГИТЕПОМОГИТЕ МНЕПОМОГИТЕМНЕМНЕ ПОМОГИТЕМНЕМНЕПОМОГИТЕ ПОМОГИТЕМНЕ МНЕ ПОМОГИТЕМНЕПОМОГИТЕ МНЕПОМОГИТЕМНЕ ПОМОГИТЕПОМОГИТЕПОМОГИТЕ МНЕПОМОГИТЕПОМОГИТЕМНЕ ПОМОГИТЕПОМОГИТЕПОМОГИТЕ МНЕПОМОГИТЕМНЕМНЕ ПОМОГИТЕМНЕМНЕПОМОГИТЕ ПОМОГИТЕМНЕ МНЕ ПОМОГИТЕМНЕПОМОГИТЕ МНЕПОМОГИТЕМНЕ ПОМОГИТЕПОМОГИТЕПОМОГИТЕ МНЕПОМОГИТЕПОМОГИТЕМНЕ ПОМОГИТЕПОМОГИТЕПОМОГИТЕ МНЕПОМОГИТЕМНЕМНЕ ПОМОГИТЕМНЕМНЕПОМОГИТЕ</b></large></large>"

/obj/item/paper/lazarus/bob_note
	desc = "Мятый лист бумаги."
	info = "Илаясу<hr>\
			Салли так и не вернул деньги за те две бутылки виски. Ты к нему слишком добр, Илаяс! Этот кретин просто бухает за наш счет, судя по слухам он должен денег чуть ли не половине инженеров. Вот увидишь, его арестуют и вышлют к черту отсюда еще к завершению строительства.<br><br>\
			Ах да, на этот раз он еще и стойку нам заблевал, а после сбежал пъяный от охраны куда-то в сторону джунглей за церковью. Пока не вернет 8 сотен — больше этому уроду не наливай!<br><br><br><br>\
			— Боб."

/// MARK: Trifles
/obj/structure/decorative_structures/corpse/leto/get_ru_names()
	return alist(
		NOMINATIVE = "тело Лето",
		GENITIVE = "тела Лето",
		DATIVE = "телу Лето",
		ACCUSATIVE = "тело Лето",
		INSTRUMENTAL = "телом Лето",
		PREPOSITIONAL = "теле Лето",
	)

/obj/structure/decorative_structures/corpse/sally/get_ru_names()
	return alist(
		NOMINATIVE = "тело Салли",
		GENITIVE = "тела Салли",
		DATIVE = "телу Салли",
		ACCUSATIVE = "тело Салли",
		INSTRUMENTAL = "телом Салли",
		PREPOSITIONAL = "теле Салли",
	)

/obj/item/reagent_containers/food/snacks/boiledrice/lazarus_bowl/get_ru_names()
	return alist(
		NOMINATIVE = "миска рис",
		GENITIVE = "миска рис",
		DATIVE = "миска рис",
		ACCUSATIVE = "миска рис",
		INSTRUMENTAL = "миска рис",
		PREPOSITIONAL = "миска рис",
	)
/obj/item/toy/plushie/cat/ricehat/lazarus_wife/get_ru_names()
	return alist(
		NOMINATIVE = "плюшевая кошка жена",
		GENITIVE = "плюшевой кошка жена",
		DATIVE = "плюшевой кошка жена",
		ACCUSATIVE = "плюшевую кошка жена",
		INSTRUMENTAL = "плюшевой кошка жена",
		PREPOSITIONAL = "плюшевой кошка жена",
	)

/obj/item/storage/funeral_urn/with_ash/lazarus_donny
	desc = "Эта металлическая тара отчаянно пытается притворяться ритуальной чашей. Судя по характерной красно-синей расцветке, это тот самый «умеренно приглянувшийся сосуд», который ассистенты стащили со склада торговых автоматов в жилом блоке планетарной колонии. Внутри до сих пор пахнет дешевым синтетическим кофе и... чьим-то прахом?"

/obj/item/storage/funeral_urn/with_ash/lazarus_donny/get_ru_names()
	return alist(
		NOMINATIVE = "пустая кофейная урна Донни",
		GENITIVE = "пустой кофейной урны Донни",
		DATIVE = "пустой кофейной урне Донни",
		ACCUSATIVE = "пустую кофейную урну Донни",
		INSTRUMENTAL = "пустой кофейной урной Донни",
		PREPOSITIONAL = "пустой кофейной урне Донни",
	)

/obj/structure/sign/poster/contraband/atmosia_independence/lazarus
	desc = "Реликвия прошлого. Этот документ датируется 2544 годом. В нем описывается как колония Лазарь была основана Транс-Солнечной Федерацией и восхволяешь мужество и патриотизм колонистов."

/obj/structure/sign/poster/contraband/atmosia_independence/lazarus/get_ru_names()
	return alist(
		NOMINATIVE = "документ об основании колонии Лазарь",
		GENITIVE = "документа об основании колонии Лазарь",
		DATIVE = "документу об основании колонии Лазарь",
		ACCUSATIVE = "документ об основании колонии Лазарь",
		INSTRUMENTAL = "документом об основании колонии Лазарь",
		PREPOSITIONAL = "документе об основании колонии Лазарь",
	)

/obj/structure/statue/gold/hop/lazarus
	desc = "Это статуя олицетворяет высокого мужчину человека, одетого в корпоративную одежду НТ. Одного из руководителей реконструкции колонии Лазарь, после индциндента 2550 года. Статуя полностью вылета из золота."

/obj/structure/statue/gold/hop/lazarus/get_ru_names()
	return alist(
		NOMINATIVE = "статуя высокого человека в костюме",
		GENITIVE = "статуи высокого человека в костюме",
		DATIVE = "статуе высокого человека в костюме",
		ACCUSATIVE = "статую высокого человека в костюме",
		INSTRUMENTAL = "статуей высокого человека в костюме",
		PREPOSITIONAL = "статуе высокого человека в костюме",
	)

/obj/structure/statue/gold/tajaran/lazarus
	desc = "Это статуя олицетворяет девушку таяру. Одну из руководителей реконструкции колонии Лазарь, после индциндента 2550 года. Статуя полностью вылета из золота."

/obj/structure/statue/gold/tajaran/lazarus/get_ru_names()
	return alist(
		NOMINATIVE = "статуя неизвестной таяры",
		GENITIVE = "статуи неизвестной таяры",
		DATIVE = "статуе неизвестной таяры",
		ACCUSATIVE = "статую неизвестной таяры",
		INSTRUMENTAL = "статуей неизвестной таяры",
		PREPOSITIONAL = "статуе неизвестной таяры",
	)

/obj/effect/decal/remains/human/lazarus
	desc = "Эти человеческие кости уже довольно старые. Видимо этого парня тут давным давно забыли."
