/** Window sizes in pixels */
export enum WindowSize {
  Small = 30,
  Medium = 50,
  Large = 70,
  Width = 270,
}
/** Line lengths for autoexpand */
export enum LineLength {
  Small = 20,
  Medium = 40,
}

/**
 * Radio prefixes.
 * Displays the name in the left button, tags a css class.
 */
export const RADIO_PREFIXES = {
  ':r ': 'П-Ухо',
  ':l ': 'Л-Ухо',
  ':i ': 'Интерком',
  ':h ': 'Отдел',
  ':р ': 'Отдел',
  ':c ': 'Команд',
  ':с ': 'Команд',
  ':n ': 'Наука',
  ':т ': 'Наука',
  ':m ': 'Мед',
  ':ь ': 'Мед',
  ':x ': 'Юр',
  ':ч ': 'Юр',
  ':e ': 'Инж',
  ':у ': 'Инж',
  ':s ': 'СБ',
  ':ы ': 'СБ',
  ':. ': 'Закл',
  ':ю ': 'Закл',
  ':Ю ': 'Закл',
  ':t ': 'Синди',
  ':е ': 'Синди',
  ':u ': 'Снабж',
  ':г ': 'Снабж',
  ':z ': 'Обслуж',
  ':я ': 'Обслуж',
  ':p ': 'ИИ',
  ':з ': 'ИИ',
  ':$ ': 'ОБР',
  ':- ': 'ССО',
  ':_ ': 'ДОС',
  ':+ ': 'Спец',
  ':b ': 'Бинарный',
  ':и ': 'Бинарный',
  ':, ': 'Тайпан',
  ':б ': 'Тайпан',
  ":' ": 'СССП',
  "#' ": 'СССП',
  ':э ': 'СССП',
  ':* ': 'КланПаука',
  ':1 ': 'Альфа',
  ':2 ': 'Бета',
  ':3 ': 'Гамма',
  ':vr ': 'Воксы',
  ':мк ': 'Воксы',
} as const;

export const BINARY_PREFIXES = {
  ':b ': true,
  '#b ': true,
  '.b ': true,
  '.и ': true,
  ':и ': true,
};
